{
  "name": "Flávio Dias",
  "title": "Mechanical Simulation & Analysis Engineer",
  "location": "Santarém, Pará, Brazil",
  "email": "flaviohasd@hotmail.com",
  "linkedin": "https://www.linkedin.com/in/flaviohasd/",
  "github": "https://github.com/flaviohasd",
  "summary": "Mechanical engineer specialized in simulation, dynamic modeling, and process optimization, with solid industrial experience in HPDC/LPDC operations and published research achieving up to 99% reduction in gear-mesh dynamic responses through optimized tooth-profile modification. Skilled in CAE, MATLAB, and Python for dynamic, structural, and multiphysics simulation, integrating results with real production data for decision-making and process stability. Fluent in English (self-taught, C1/C2 level) with strong analytical thinking, technical communication, and international collaboration experience.",
  "subsummary": "Industrial & Process Engineering background — CAE · Optimization",
  "experience": [
    {
      "title": "Industrial & Process Engineer",
      "company": "Yamaha Motor do Brasil",
      "date": "Apr 2023 - Apr 2025",
      "tasks": [
        "Managed and executed the BRL 8 million die-renewal project, covering redesign, validation, and manufacturing of HPDC molds in compliance with ISO 8062.",
        "Applied MAGMASOFT multiphysics simulations to analyze flow, thermal balance, solidification, and porosity formation, supporting tooling redesign and process optimization.",
        "Improved casting stability, reduced defect rates, and extended mold life through data-driven parameter optimization.",
        "Eliminated chronic dimensional deviations using DMAIC/PDCA methodologies and root-cause analysis.",
        "Made engineering decisions by correlating simulation outputs with production and maintenance data."
      ]
    },
    {
      "title": "Industrial Analyst",
      "company": "Yamaha Motor do Brasil",
      "date": "Jul 2021 - Nov 2021",
      "tasks": [
        "Conducted constraint evaluation and process diagnostics in welding and stamping systems.",
        "Applied PDCA/DMAIC to eliminate recurring issues and enhance process reliability.",
        "Delivered measurable improvements in rework reduction and process stability."
      ]
    },
    {
      "title": "Mechanical Engineering Intern",
      "company": "UFAM - Faculty of Technology",
      "date": "May 2022 - Aug 2022",
      "tasks": [
        "Led the restructuring of the Mechanical Systems and Control Laboratory, including installation of a laser cutting machine and redesign of the infrastructure.",
        "Implemented 5S techniques, authored a best-practices manual, and improved safety and accessibility.",
        "Enabled simultaneous experiments and supported the lab’s physical expansion."
      ]
    },
    {
      "title": "Teaching Assistant - Mechanical Vibrations",
      "company": "UFAM - Federal University of Amazonas",
      "date": "May 2022 - Sep 2022",
      "tasks": [
        "Supported vibration measurement and analysis using accelerometers and DAQ systems.",
        "Guided students in FFT analysis, signal interpretation, and correlation between experimental and analytical data."
      ]
    },
    {
      "title": "Engineering Intern",
      "company": "3M do Brasil",
      "date": "Jan 2020 - Jul 2021",
      "tasks": [
        "Developed reliability dashboards (OEE, MTBF, MTTR) integrating maintenance and production data.",
        "Supported preventive maintenance planning and equipment reliability analysis."
      ]
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Science",
      "field": "Mechanical Engineering",
      "institution": "Federal University of Amazonas (UFAM)",
      "date": "2015 - 2022",
      "comments": [
        "I have excelled in the areas of strength of materials, mechanical vibrations, machine elements, modeling, analysis, and control of dynamic systems."
      ]
    }
  ],
  "skills": [
    "MATLAB",
    "Python",
    "Multiphysics Simulation",
    "Optimization",
    "CAD/CAE (SolidWorks, Inventor, Solid Edge, AutoCAD)",
    "FEA/FEM (modal, static, dynamic, stress analysis)",
    "Power BI",
    "Excel Advanced",
    "Root-Cause Analysis",
    "Lean Six Sigma",
    "DMAIC",
    "PDCA",
    "FMEA",
    "PPAP",
    "ISO 8062",
    "ISO 9001"
  ],
  "certifications": [
    {
      "name": "IBM Data Analyst",
      "institution": "IBM Skills Network",
      "date": "2023"
    },
    {
      "name": "CS50: Introduction to Computer Science",
      "institution": "MIT/edX",
      "date": "2023"
    },
    {
      "name": "Lean Six Sigma Green Belt",
      "institution": "Escola DNC",
      "date": "2021"
    },
    {
      "name": "MAGMASOFT Simulation Training",
      "institution": "MAGMA",
      "date": "2024"
    },
    {
      "name": "Minitab Statistical Tools",
      "institution": "Escola DNC",
      "date": "2022"
    },
    {
      "name": "Power BI - Data Visualization",
      "institution": "Escola DNC",
      "date": "2022"
    }
  ],
  "languages": [
    "Portuguese: Native",
    "English: Fluent (C1/C2 self-taught; full professional proficiency)"
  ],
  "projects": [
    {
      "title": "Gear Mesh Vibration Optimization",
      "description": "Implemented an alternative dynamic model for spur-gear vibration prediction with improved equivalent-mass formulation. Achieved up to 99% reduction in dynamic responses through MATLAB-based simulations. Published in the Journal of the Brazilian Society of Mechanical Sciences and Engineering (Springer).",
      "repository": "https://github.com/flaviohasd/TPM-Vibration"
    }
  ],
  "publications": [
    {
      "title": "Vibration attenuation on spur gears through optimal profile modification",
      "journal": "Journal of the Brazilian Society of Mechanical Sciences and Engineering (Springer)",
      "year": "2023",
      "link": "https://rdcu.be/ds3ID"
    }
  ]
}
